_Brian_Matheson/Movie_App/app/views/movies/index.html.erb

SELECT  "movies".* FROM "movies"  WHERE (title LIKE '%godfather%')  ORDER BY "movies"."id" DESC LIMIT 1
---
<h2>List movies</h2>
<p>See our <blink>amazing</blink> collection of <%= Movie.last.id %> movies below</p>

SELECT  "movies".* FROM "movies"  WHERE (title LIKE '%godfather%') AND "movies"."id" = ? LIMIT 1  [["id", 1]]
---
<td>
<%= Movie.find(i).id %>