_Brian_Matheson/Movie_App/app/views/movies/show.html.erb

<h2>Show movie</h2>
<p>Enjoy our <blink>thoughtful</blink> description of <%= Movie.find(params[:id]).title %>  </p>
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]