_Brian_Matheson/Movie_App/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies"  WHERE (title LIKE '%godfather%')  ORDER BY "movies"."id" DESC LIMIT 1
---
  def index
    if params[:q]
      @movie = Movie.search(params[:q])